---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeFrontDirn2
source: html/fe8333e0-f250-f86c-0c86-9c30f4b07f07.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemHookTypeFrontDirn2 Property

"Exterior Minor Hook Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemHookTypeFrontDirn2 { get; }
```